/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   atoi.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vshpilev <vshpilev@student.hive.fi>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/24 13:23:01 by vshpilev          #+#    #+#             */
/*   Updated: 2024/09/24 13:23:03 by vshpilev         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


#include "push_swap.h"

int	ft_atoi_ver_2(const char *str)
{
	int				mod;
	long long int	i;

	i = 0;
	mod = 1;
	while (*str == ' ' || *str == '\t' || *str == '\n' || *str == '\f'
		|| *str == '\v' || *str == '\r')
		str++;
	if (*str == '-' || *str == '+')
	{
		if (*str == '-')
			mod = -1;
		str++;
	}
	if (*str == '\0')  // Проверка на пустую строку после знака
		error();

	while (*str)
	{
		if (!ft_isdigit(*str))
			error();
		if (i > 2147483647 / 10 || (i == 2147483647 / 10 && (*str - '0') > 7))
		{
			if (mod == 1)
				error();  // Переполнение положительного числа
			else if (mod == -1 && i > 2147483648 / 10)
				error();  // Переполнение отрицательного числа
		}
		i = i * 10 + (*str - '0');
		str++;
	}
	return (mod * i);
}
